Revit 2027 API
RebarUpdateCurvesData.GetRebarStyle Method
 Gets the style of the rebar.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarStyle GetRebarStyle()
Public Function GetRebarStyle As RebarStyle
public:
RebarStyle GetRebarStyle()
member GetRebarStyle : unit -> RebarStyle
Return Value
RebarStyle
 Gets the style of the rebar (Standard or StirrupTie).
See Also
Reference
RebarUpdateCurvesData Class
Autodesk.Revit.DB.Structure Namespace